# RebarHandlesData Properties

---
The RebarHandlesData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace